Repository: JellyTyan/Charlotte
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: pl, ru, uk, vi

source: Send a message with the news
pl: Wyślij wiadomość z aktualnościami
ru: Отправьте сообщение с новостями
uk: Надішліть повідомлення з новиною
vi: 📢 Gửi tin tức ngay!

source: Mailing list started
pl: Uruchomiono listę mailingową
ru: Запущена рассылка
uk: Розсилку розпочато
vi: 📬 Bắt đầu gửi mail!

source: The mailing has been completed Beginning at {start_time} Ended at {end_time} Number of chats: {total_chat} Successfully sent: {sucсess_send} erros: {error_send}
pl: Wysyłka została zakończona Rozpoczęto o {start_time} Zakończono o {end_time} Liczba czatów: {total_chat} Wysłano pomyślnie: {sucсess_send} Błąd: {error_send}
ru: Рассылка завершена Началась в {start_time} Закончилась в {end_time} Количество чатов: {total_chat} Успешно отправлено: {sucсess_send} Ошибки: {error_send}
uk: Розсилка завершена Початок о {start_time} Закінчено о {end_time} Кількість чатів: {total_chat} Успішно відправлено: {sucсess_send} помилки: {error_send}
vi: ✅ Quá trình gửi mail đã hoàn tất Bắt đầu lúc {start_time} Kết thúc lúc {end_time} Số lượng chat: {total_chat} Gửi thành công: {sucсess_send} Lỗi: {error_send}

source: <b>Hey, {name}! I'm here to help you</b> Here are the main commands: /start – Start using the bot /help – Show this help message /settings – Bot settings /support – Support my creator I can download media from a wide range of platforms. Here's what I support: <b>Music Platforms</b> - Spotify - Apple Music - SoundCloud I’ll fetch the music, with title, artist, and cover. <b>Video Platforms</b> - YouTube – Videos, Shorts, or just audio (up to 50 MB) - TikTok – Videos and images - BiliBili – Full video support (with limitations) - Instagram – Reels and posts - Twitter – Videos and images - Reddit – Media from posts <b>Art Platforms</b> - Pixiv – I can download illustrations for you - Pinterest – I can download all media for you Just send a link — and I’ll take care of the rest.
ru: Привет, {name}! Я здесь, чтобы помочь тебе ✨ Вот основные команды: /start – Начать пользоваться ботом /help – Показать это справочное сообщение /settings – Настройки бота /support – Поддержать моего создателя 💖 Я умею скачивать медиа с множества разных платформ! Вот что я поддерживаю: 🎵 Музыкальные платформы • Spotify • Apple Music • SoundCloud Я найду музыку с названием, артистом и обложкой 🎶 🎬 Видеоплатформы • YouTube – Видео, Shorts или только аудио (до 50 МБ) • TikTok – Видео и изображения • BiliBili – Полная поддержка видео (с ограничениями) • Instagram – Reels и посты • Twitter – Видео и изображения • Reddit – Медиа из постов 🎨 Арт-платформы • Pixiv – Я могу скачать для тебя иллюстрации ✨ • Pinterest – Скачаю всё медиа, что найду! Просто пришли мне ссылку — и я всё сделаю сама 💌
uk: Привіт, {name}! Я тут, щоб допомогти тобі 🌟 Ось основні команди: /start — Почати користування ботом /help — Показати це повідомлення допомоги /settings — Налаштування бота /support — Підтримати мого творця 💖 Я вмію завантажувати медіа з багатьох платформ. Ось що я підтримую: 🎵 Музичні платформи • Spotify • Apple Music • SoundCloud Завантажу музику з назвою, виконавцем і обкладинкою 🎧 🎬 Відеоплатформи • YouTube — Відео, Shorts або лише аудіо (до 50 МБ) • TikTok — Відео та зображення • BiliBili — Повна підтримка відео (з обмеженнями) • Instagram — Reels і пости • Twitter — Відео та картинки • Reddit — Медіа з постів 🎨 Арт-платформи • Pixiv — Завантажу ілюстрації спеціально для тебе ✨ • Pinterest — Скачаю усі медіа, які знайду! Просто надішли мені посилання — і я все зроблю 💌
vi: Xin chào, {name}! Mình ở đây để giúp bạn 🌟 Đây là những lệnh chính: /start – Bắt đầu sử dụng bot /help – Hiển thị hướng dẫn này /settings – Cài đặt bot /support – Ủng hộ tác giả 💖 I can download media from a bunch of platforms!

source: Your download has been cancelled.
pl: 🚫 Puf! Twój plik właśnie wyparował w powietrzu!
ru: 🚫 Пшик! Твоя загрузка испарилась в воздухе!
uk: 🚫 Пух! Твоє завантаження щезло, наче дим!
vi: 🚫 Ưu lại! Việc tải đã bị huỷ bỏ rồi!

source: No active download task found to cancel.
pl: 🌸 Nie znaleziono aktywnego pobierania do anulowania. Ale spokojnie, jestem tutaj, gdybyś mnie potrzebował!
ru: 🌸 Активных загрузок для отмены не найдено. Но не переживай, я всегда тут, если что!
uk: 🌸 Активних завантажень для скасування не знайдено. Але не хвилюйся, я тут, якщо що!
vi: 🌸 Không tìm thấy tác vụ tải nào để huỷ. Mà đừng lo, mình luôn sẵn sàng nếu bạn cần!

source: You have no rights to edit these settings!
pl: 🙅‍♀️ Ups! Nie masz uprawnień do edycji tych ustawień.
ru: 🙅‍♀️ Похоже, у тебя уже есть активная загрузка! Если хочешь её отменить, используй /cancel.
uk: 🙅‍♀️ Ой! У тебе немає прав для зміни цих налаштувань.
vi: 🙅‍♀️ Ối! Bạn không có quyền chỉnh sửa cài đặt này. Nếu bạn là quản trị viên, hãy bật quyền và thử lại nhé.

source: Pick a language!
pl: 🌍 Wybierz język!
ru: ✨ Выберите язык, который вам удобен! 😊
uk: 🌍 Вибери мову!
vi: 🌍 Chọn một ngôn ngữ nào!

source: Canceled!
pl: 💔 Anulowane! Jeśli to pomyłka, jestem tutaj, aby pomóc!
ru: 💔 Отменено! Если это ошибка, я всегда здесь, чтобы помочь!
uk: 💔 Скасовано! Якщо це помилка, я завжди тут, щоб допомогти!
vi: 💔 Đã huỷ! Nếu bạn nhầm, mình luôn sẵn sàng trợ giúp!

source: Henlooooooooooooooooooooooooooooooooooooooooooooooo Nice to meet you, {name}! I'm Charlotte - my hobby is pirating content from various resources. Use _/help_ for more info on me, commands and everything! If something doesn't work, email @jellytyan, or better yet if you send a link to what didn't download🧡 P.S.: There is Charlotte Basement, where is posted new updates or service status @charlottesbasement
ru: Henlooooooooooooooooooooooooooooooooooooooooooooooo~ 💫 Рада познакомиться, {name}! 💚 Я — Шарлотка, и моё хобби — пиратить контент с разных сайтов! 🏴‍☠️📥 Введи /help, чтобы узнать больше обо мне, командах и возможностях! ✨ Если что-то не работает — напиши @jellytyan, а ещё лучше — пришли ссылку, которая не скачалась 🧡 P.S.: Есть Charlotte Basement, где публикуются обновления и статус сервисов: @charlottesbasement 🔧📢
uk: Henlooooooooooooooooooooooooooooooooooooooooooooooo~ 💫 Рада з тобою познайомитись, {name}! 💚 Я — Шарлотка, моє хобі — піратити контент з різних сайтів! 🏴‍☠️📥 Напиши /help, щоб дізнатись більше про мене, команди та інші фішки! ✨ Якщо щось не працює — пиши @jellytyan, а ще краще — надішли посилання, яке не завантажилось 🧡 P.S.: Існує Charlotte Basement, де публікуються новини та статус сервісів: @charlottesbasement 🔧📢
vi: Henlooooooooooooooooooooooooo~ 💫 Rất vui được gặp bạn, {name}! 💚 Mình là Charlotte – sở thích là tải nội dung từ nhiều nơi! 🏴‍☠️📥 Dùng /help để tìm hiểu thêm về mình, các lệnh và những thứ mình làm được! ✨ Nếu có gì không ổn — nhắn @jellytyan, hoặc tốt hơn là gửi link không tải được 🧡 P.S.: Có một kênh Charlotte Basement để cập nhật và tình trạng dịch vụ: @charlottesbasement 🔧📢

source: After some thought, I dare to leave a link to support the project. If you have a desire to improve the work of Charlotte, please follow this link. Every dollar helps keep Charlotte on a quality server just for you. You are not obligated to pay. Only if you have the desire!!!! https://buymeacoffee.com/jellytyan https://ko-fi.com/jellytyan
ru: После долгих раздумий… я осмелилась оставить ссылочку на поддержку проекта 🌸 Если у тебя есть желание помочь в развитии Шарлотки — переходи по ссылке! Каждый доллар помогает держать Шарлотку на качественном сервере — только для тебя ☁️💚 Разумеется, ты ничего не обязан. Только если сам захочешь!!! 💖 https://buymeacoffee.com/jellytyan https://ko-fi.com/jellytyan
uk: Після деяких роздумів… наважилась залишити посилання на підтримку проєкту 🌸 Якщо маєш бажання допомогти Шарлотці працювати ще краще — переходь за цими лінками! Кожен долар допомагає тримати Шарлотку на якісному сервері — тільки для тебе ☁️💚 Звісно ж, нічого не зобов’язує. Тільки якщо справді захочеш!!! 💖 https://buymeacoffee.com/jellytyan https://ko-fi.com/jellytyan
vi: Sau một hồi suy nghĩ… mình quyết định để lại link ủng hộ nhỏ 🌸 Nếu bạn muốn giúp cải thiện Charlotte, xin mời dùng các link dưới! Mỗi đô la giúp Charlotte chạy trên server tốt hơn – chỉ dành cho bạn ☁️💚 Tất nhiên, bạn không bị bắt buộc. Chỉ khi bạn muốn thôi!!! 💖 https://buymeacoffee.com/jellytyan https://ko-fi.com/jellytyan

source: Video
pl: 🎥 Wideo
ru: 🎥 Видео
uk: 🎥Відео

source: Audio
ru: 🎶Аудио
uk: 🎶Аудіо

source: Choose a format to download:
pl: ✨ Wybierz format do pobrania:
ru: ✨ Выбери формат для скачивания:
uk: ✨ Вибери формат для завантаження:
vi: ✨ Chọn định dạng để tải về:

source: The selection format is only available for YouTube.
pl: 🌸 Wybór formatu jest dostępny tylko dla YouTube. 😊
ru: 🌸 Выбор формата доступен только для YouTube. 😊
uk: 🌸 Вибір формату доступний лише для YouTube. 😊
vi: 🌸 Định dạng lựa chọn chỉ dành cho YouTube. 😊

source: Download completed.
pl: 🎉 Pobieranie zakończone! Jeśli potrzebujesz czegoś jeszcze, śmiało pytaj! 💖
ru: 🎉 Загрузка завершена! Если нужно что-то еще, не стесняйся, спрашивай! 💖
uk: 🎉 Завантаження завершено! Якщо потрібно ще щось, не соромся питати! 💖
vi: 🎉 Tải xong rồi! Nếu bạn cần gì khác, cứ nói nhé! 💖

source: I'm sorry. You may have provided a corrupted link, private content or 18+ content 🤯
ru: Извините. Возможно, вы предоставили поврежденную ссылку, приватное содержимое или содержимое 18+ 🤯
uk: Вибачте. Можливо, ви надали пошкоджене посилання, приватний контент або контент 18+ 🤯
vi: Xin lỗi nhé. Có thể bạn đã cung cấp link hỏng, nội dung riêng tư hoặc nội dung 18+ 🤯

source: Critical error #022 - media file is too large
pl: ⚠️ Krytyczny błąd #022 – Plik multimedialny jest za duży.
ru: ⚠️ Критическая ошибка #022 – Медиафайл слишком большой.
uk: ⚠️ Критична помилка #022 – Медіафайл занадто великий.
vi: ⚠️ Lỗi nghiêm trọng #022 – file media quá lớn.

source: Wow, you tried to download too heavy media. Don't do this, pleeease 😭
ru: Вы пытались загрузить слишком тяжелое медиа. Не делайте этого, пожалуйста 😭
uk: Ого, ви намагалися завантажити занадто важкий медіафайл. Не робіть цього, будь ласка 😭
vi: Ôi, bạn đang cố tải nội dung quá nặng. Đừng làm vậy nữa nhé, làm ơn 😭

source: Sorry, I couldn't download the media.
ru: Извините, я не смогла загрузить медиафайл.
uk: Вибачте, я не змогла завантажити медіа.
vi: 😢 Xin lỗi, mình không thể tải nội dung này.

source: Download canceled.
pl: 💔 Ups, anulowałam pobieranie! Jeśli to pomyłka, daj mi znać, a coś na to zaradzę!
ru: 💔 Ой, я отменила загрузку! Если это ошибка, просто скажи, и я всё поправлю!
uk: 💔 Ой, я скасувала завантаження! Якщо це помилка, просто скажи, і я все виправлю!
vi: 💔 Đã huỷ tải. Nếu bạn nhầm, mình luôn sẵn sàng giúp!

source: Get playlist items error
ru: Ошибка при получении элементов плейлиста
uk: Помилка отримання елементів плейлісту
vi: 🚫 Có lỗi khi lấy danh sách phát. Hãy thử lại sau nhé!

source: Sorry, there was an error. Try again later 🧡
pl: 😔 Przepraszam, wystąpił błąd. Spróbuj ponownie później 🧡
ru: 😔 Извини, произошла ошибка. Попробуй снова позже 🧡
uk: 😔 Вибач, сталася помилка. Спробуй пізніше 🧡
vi: 😔 Xin lỗi, đã có lỗi xảy ra. Hãy thử lại sau nhé 🧡

source: <b>Hey, {name}! You've reached out for help!</b> To get started, here are the commands available <i>to you</i>: <i>/start</i> - start using the bot <i>/help</i> - get a list of available commands <i>/settings</i> - bot settings <i>/support</i> - for support me :3 But that's just the beginning! I download media for you from anywhere! (even BiliBili) Let me list all the available sources for you: <b>Youtube</b> - I'll download videos, shorts, or music from videos for you! There's a 50 MB limit per video. <b>Soundcloud</b> - I'll download music, add the cover, title, and artist to make it all look perfect! <b>Spotify</b> - Similar functionality to Soundcloud, but for Spotify! <b>Apple Music</b> - Same here! Only beauty! <b>TikTok</b> - I'll download videos and images for you! <b>Pinterest</b> - I can download videos and photos for you. <b>BiliBili</b> - It's a bit of a hassle, but I can send you videos. <b>Twitter</b> - I'll download videos and photos for you. <b>Instagram</b> - I'll download photos or Reels for you. <b>Pixiv</b> - I'll download artworks for you.
pl: Hej, {name}! Zgłosiłeś się po pomoc — więc oto jestem! ✨ Zaczynajmy! Oto Twoje komendy: 🔹 /start – Zacznij używać bota! 🔹 /help – Zobacz, co potrafię ✨ 🔹 /settings – Dostosuj mnie do swoich potrzeb! 💖 /support – Pokażesz mi trochę miłości? :3 A wiesz co? Potrafię pobrać media prawie z każdego miejsca! 🎉 🎵 Muzyka – Pobieram utwory z YouTube Music, SoundCloud, Spotify i Apple Music, dodając okładki i szczegóły! 📺 Wideo i zdjęcia – Z YouTube, TikTok, Twitter, Instagram, Pinterest, Pixiv a nawet BiliBili! (Limit na YouTube: 50MB)

source: Henlooooooooooooooooooooooooooooooooooooooooooooooo Nice to meet you, {name}! I'm Charlotte - my hobby is pirating content from various resources. Use _/help_ for more info on me, commands and everything! If something doesn't work, email @jellyfrogirl, or better yet if you send a link to what didn't download🧡
pl: Henloooooooooooooooooooooooooooooooooooooooooooooo! 🐾 Miło cię poznać, {name}! 😊 Jestem Charlotte, a moje hobby? Cóż, jestem piratem treści — zbieram wszystko fajne z internetu! 🎉 Użyj /help, aby odkryć wszystko o mnie, komendy i całą magię, którą potrafię zrobić! ✨ Jeśli coś nie działa, śmiało napisz na e-mail @jellytyan, albo lepiej, wyślij mi link do tego, czego nie udało się pobrać 🧡

source: After some thought, I dare to leave a link to support the project. If you have a desire to improve the work of Charlotte, please follow this link. For every 3 dollars I can buy a month of hosting that is 2 times better than the current one, which means Charlotte will respond faster even when busy. You are not obligated to pay. Only if you have the desire!!!! https://buymeacoffee.com/jellytyan
pl: Po kilku przemyśleniach, mam odwagę zostawić link, aby wspierać mój projekt\! 🧡 Za każde 3$ mogę przejść na szybszy plan hostingowy, co oznacza, że Charlotte będzie odpowiadać jeszcze szybciej, nawet gdy będzie zajęta\! 🚀 Ale pamiętaj, nie ma absolutnie żadnych zobowiązań\! Tylko jeśli masz ochotę\! 😊 👉 Support Charlotte: https://buymeacoffee\.com/jellytyan

source: Sorry, the download returned empty content. Please check the link and try again.
pl: 😔 Przepraszam, pobieranie zwróciło pustą zawartość. Sprawdź link i spróbuj ponownie.

source: Wow, you tried to download too heavy video. Don't do this, pleeease 😭
pl: Wow, próbowałeś pobrać zbyt ciężkie wideo. Nie rób tego, proszę 😭

source: Wow, you tried to download too heavy audio. Don't do this, pleeease 😭
pl: Wow, próbowałeś pobrać zbyt ciężkie audio. Nie rób tego, proszę 😭
